Table of Contents
 Enum SecondOrderEffectMethodEc2
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
The type of method for calculation second order effect.
public enum SecondOrderEffectMethodEc2
Fields
NominalCurvature = 1
The method based on nominal curvature. This method is primarily suitable for isolated members with constant normal force and a defined effective length.
NominalStiffness = 0
The following model may be used to estimate the nominal stiffness of slender compression members with arbitrary cross section.
Fields
 Name |  Description
 NominalCurvature = 1
The method based on nominal curvature. This method is primarily suitable for isolated members with constant normal force and a defined effective length.
 NominalStiffness = 0
The following model may be used to estimate the nominal stiffness of slender compression members with arbitrary cross section.
 Edit this page